In [6]:
import pandas as pd

In [7]:
column_name = ['Id', 'Name', 'Age', 'Weight', 'm0006', 'm0612', 'm1218', 'f0006', 'f0612', 'f1218']
df = pd.read_csv('patient_heart_rate.csv', names=column_name)

In [8]:
df=df.drop(index=0)
df=df.reset_index(drop=True)

In [9]:
df.head(10)

    Id            Name  Age      Weight m0006 m0612 m1218 f0006 f0612 f1218
0    1    Mickéy Mousé   56       70kgs    72    69    71     -     -     -
1    2     Donald Duck   34   154.89lbs     -     -     -    85    84    76
2    3      Mini Mouse   16         NaN     -     -     -    65    69    72
3    4  Scrooge McDuck  NaN       78kgs    78    79    72     -     -     -
4    5    Pink Panther   54  198.658lbs     -     -     -    69   NaN    75
5    6     Huey McDuck   52      189lbs     -     -     -    68    75    72
6    7    Dewey McDuck   19       56kgs     -     -     -    71    78    75
7    8      Scööpy Doo   32       78kgs    78    76    75     -     -     -
8  NaN             NaN  NaN         NaN   NaN   NaN   NaN   NaN   NaN   NaN
9  NaN             NaN  NaN         NaN   NaN   NaN   NaN   NaN   NaN   NaN

In [10]:
df[['Firstname','Lastname']] = df['Name'].str.split(expand=True)
df = df.drop('Name',axis=1)
df.head(5)

  Id  Age      Weight m0006 m0612 m1218 f0006 f0612 f1218 Firstname Lastname
0  1   56       70kgs    72    69    71     -     -     -    Mickéy    Mousé
1  2   34   154.89lbs     -     -     -    85    84    76    Donald     Duck
2  3   16         NaN     -     -     -    65    69    72      Mini    Mouse
3  4  NaN       78kgs    78    79    72     -     -     -   Scrooge   McDuck
4  5   54  198.658lbs     -     -     -    69   NaN    75      Pink  Panther

In [11]:
weight = df['Weight']

for i in range(0, len(weight)):
    x = str(weight[i])
    if 'lbs' in x[-3:]:
        x = x[:-3:]
        float_x = float(x)
        y = int(float_x/2.2)
        y =str(y)
        weight[i]=y
    if 'kgs' in x[-3:]:
        x = x[:-3:]
        float_x = float(x)
        weight[i]=x

In [12]:
df.rename(columns={'Weight':'Weight_kgs'},inplace=True)

In [13]:
df.head(5)

  Id  Age Weight_kgs m0006 m0612 m1218 f0006 f0612 f1218 Firstname Lastname
0  1   56         70    72    69    71     -     -     -    Mickéy    Mousé
1  2   34         70     -     -     -    85    84    76    Donald     Duck
2  3   16        NaN     -     -     -    65    69    72      Mini    Mouse
3  4  NaN         78    78    79    72     -     -     -   Scrooge   McDuck
4  5   54         90     -     -     -    69   NaN    75      Pink  Panther

In [14]:
df.dropna(how='all', inplace=True)

In [15]:
df = df.drop_duplicates(subset=['Firstname', 'Lastname', 'Age', 'Weight_kgs'])

In [16]:
df.Firstname.replace({r'[^\x00-\x7F]+':''}, regex=True, inplace=True)
df.Lastname.replace({r'[^\x00-\x7F]+':''}, regex=True, inplace=True)

In [17]:
df['Age'].fillna(df['Age'].mode()[0], inplace=True)

In [18]:
df['Weight_kgs'].fillna(df['Weight_kgs'].median(), inplace=True)

In [19]:
print(df)

    Id Age Weight_kgs m0006 m0612 m1218 f0006 f0612 f1218 Firstname Lastname
0    1  56         70    72    69    71     -     -     -     Micky     Mous
1    2  34         70     -     -     -    85    84    76    Donald     Duck
2    3  16       74.0     -     -     -    65    69    72      Mini    Mouse
3    4  34         78    78    79    72     -     -     -   Scrooge   McDuck
4    5  54         90     -     -     -    69   NaN    75      Pink  Panther
5    6  52         85     -     -     -    68    75    72      Huey   McDuck
6    7  19         56     -     -     -    71    78    75     Dewey   McDuck
7    8  32         78    78    76    75     -     -     -      Scpy      Doo
11  10  12         45     -     -     -    92    95    87     Louie   McDuck
12  11  34         60    78    75    72     -     -     -     Henry      Nam
13  12  34       74.0    65    67    55     -     -     -    Michel     Long
14  13  34       74.0     -     -     -    68    72    70      Tana    Ricky
15  14  34       74.0   NaN   NaN   NaN   NaN   NaN   NaN  UniLever     None
16  15  52         81     -     -     -    68    75    72       NaN      NaN

In [20]:
df = pd.melt(df, id_vars=['Id','Age','Weight_kgs','Firstname','Lastname'], 
            value_name='PulseRate', var_name='gender_time').sort_values(['Id','Age','Weight_kgs','Firstname','Lastname'])

In [21]:
print(df)

   Id Age Weight_kgs Firstname Lastname gender_time PulseRate
0   1  56         70     Micky     Mous       m0006        72
14  1  56         70     Micky     Mous       m0612        69
28  1  56         70     Micky     Mous       m1218        71
42  1  56         70     Micky     Mous       f0006         -
56  1  56         70     Micky     Mous       f0612         -
.. ..  ..        ...       ...      ...         ...       ...
21  8  32         78      Scpy      Doo       m0612        76
35  8  32         78      Scpy      Doo       m1218        75
49  8  32         78      Scpy      Doo       f0006         -
63  8  32         78      Scpy      Doo       f0612         -
77  8  32         78      Scpy      Doo       f1218         -

[84 rows x 7 columns]

In [22]:
df_temp = df['gender_time'].str.extract("(\D)(\d+)(\d{2})",expand=True)

In [23]:
df_temp.columns = ['Gender', 'Lower_hour', 'Upper_hour']

In [24]:
print(df_temp)

   Gender Lower_hour Upper_hour
0       m         00         06
14      m         06         12
28      m         12         18
42      f         00         06
56      f         06         12
..    ...        ...        ...
21      m         06         12
35      m         12         18
49      f         00         06
63      f         06         12
77      f         12         18

[84 rows x 3 columns]

In [25]:
df = pd.concat([df,df_temp], axis=1)

In [26]:
print(df)

   Id Age Weight_kgs Firstname Lastname gender_time PulseRate Gender  \
0   1  56         70     Micky     Mous       m0006        72      m
14  1  56         70     Micky     Mous       m0612        69      m
28  1  56         70     Micky     Mous       m1218        71      m
42  1  56         70     Micky     Mous       f0006         -      f
56  1  56         70     Micky     Mous       f0612         -      f
.. ..  ..        ...       ...      ...         ...       ...    ...
21  8  32         78      Scpy      Doo       m0612        76      m
35  8  32         78      Scpy      Doo       m1218        75      m
49  8  32         78      Scpy      Doo       f0006         -      f
63  8  32         78      Scpy      Doo       f0612         -      f
77  8  32         78      Scpy      Doo       f1218         -      f

   Lower_hour Upper_hour
0          00         06
14         06         12
28         12         18
42         00         06
56         06         12
..        ...        ...
21         06         12
35         12         18
49         00         06
63         06         12
77         12         18

[84 rows x 10 columns]

In [27]:
df = df.drop(['gender_time'], axis=1)

In [28]:
print(df)

   Id Age Weight_kgs Firstname Lastname PulseRate Gender Lower_hour Upper_hour
0   1  56         70     Micky     Mous        72      m         00         06
14  1  56         70     Micky     Mous        69      m         06         12
28  1  56         70     Micky     Mous        71      m         12         18
42  1  56         70     Micky     Mous         -      f         00         06
56  1  56         70     Micky     Mous         -      f         06         12
.. ..  ..        ...       ...      ...       ...    ...        ...        ...
21  8  32         78      Scpy      Doo        76      m         06         12
35  8  32         78      Scpy      Doo        75      m         12         18
49  8  32         78      Scpy      Doo         -      f         00         06
63  8  32         78      Scpy      Doo         -      f         06         12
77  8  32         78      Scpy      Doo         -      f         12         18

[84 rows x 9 columns]

In [29]:
import numpy as np

In [30]:
df =df.replace('-',np.nan).dropna(subset=['PulseRate'])

In [31]:
df.head(10)

,Id,Age,Weight_kgs,Firstname,Lastname,PulseRate,Gender,Lower_hour,Upper_hour
0,1,56,70,Micky,Mous,72,m,00,06
14,1,56,70,Micky,Mous,69,m,06,12
28,1,56,70,Micky,Mous,71,m,12,18
50,10,12,45,Louie,McDuck,92,f,00,06
64,10,12,45,Louie,McDuck,95,f,06,12
78,10,12,45,Louie,McDuck,87,f,12,18
9,11,34,60,Henry,Nam,78,m,00,06
23,11,34,60,Henry,Nam,75,m,06,12
37,11,34,60,Henry,Nam,72,m,12,18
10,12,34,74.0,Michel,Long,65,m,00,06

In [32]:
df['Firstname'].isnull().sum()

3

In [33]:
df['Lastname'].isnull().sum()

3

In [34]:
df['Firstname'].fillna('Unknown', inplace=True)
df['Lastname'].fillna('Unknown', inplace=True)

In [35]:
df.loc[df['Firstname'] == 'Unknown']

,Id,Age,Weight_kgs,Firstname,Lastname,PulseRate,Gender,Lower_hour,Upper_hour
55,15,52,81,Unknown,Unknown,68,f,00,06
69,15,52,81,Unknown,Unknown,75,f,06,12
83,15,52,81,Unknown,Unknown,72,f,12,18

In [36]:
df=df.reset_index()

In [37]:
df.to_csv('patient_heart_rate_clean.csv')